; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_35)

(:domain logistics)

(:objects
	obj0 obj2 - airport
	obj1 obj3 - city
	obj4 obj5 obj9 obj10 obj12 obj14 obj15 obj16 - package
	obj6 obj7 - truck
	obj8 obj11 - location
	obj13 - airplane
)

(:init
	(at obj4 obj2)
	(at obj5 obj0)
	(at obj6 obj0)
	(at obj7 obj2)
	(at obj9 obj0)
	(at obj10 obj2)
	(at obj12 obj11)
	(at obj13 obj2)
	(at obj14 obj2)
	(at obj15 obj2)
	(at obj16 obj0)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj8 obj3)
	(in-city obj11 obj3)
)

(:goal (and
	(at obj4 obj0)
	(at obj5 obj11)
	(at obj9 obj8)
	(at obj10 obj0)
	(at obj12 obj8)
	(at obj14 obj0)
	(at obj15 obj0)
	(at obj16 obj8)
))
)

; plan
1. (drive obj7 obj2 obj11)
   deleted: (at obj7 obj2)
   added: (at obj7 obj11)
   goals met: 0 of 8
2. (load obj13 obj10 obj2)
   deleted: (at obj10 obj2)
   added: (in obj10 obj13)
   goals met: 0 of 8
3. (load obj13 obj14 obj2)
   deleted: (at obj14 obj2)
   added: (in obj14 obj13)
   goals met: 0 of 8
4. (load obj13 obj15 obj2)
   deleted: (at obj15 obj2)
   added: (in obj15 obj13)
   goals met: 0 of 8
5. (load obj13 obj4 obj2)
   deleted: (at obj4 obj2)
   added: (in obj4 obj13)
   goals met: 0 of 8
6. (fly obj13 obj2 obj0)
   deleted: (at obj13 obj2)
   added: (at obj13 obj0)
   goals met: 0 of 8
7. (drive obj7 obj11 obj8)
   deleted: (at obj7 obj11)
   added: (at obj7 obj8)
   goals met: 0 of 8
8. (load obj13 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj13)
   goals met: 0 of 8
9. (load obj13 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj13)
   goals met: 0 of 8
10. (load obj13 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj13)
   goals met: 0 of 8
11. (unload obj13 obj10 obj0)
   deleted: (in obj10 obj13)
   added: (at obj10 obj0)
   goals met: 1 of 8
12. (unload obj13 obj14 obj0)
   deleted: (in obj14 obj13)
   added: (at obj14 obj0)
   goals met: 2 of 8
13. (unload obj13 obj15 obj0)
   deleted: (in obj15 obj13)
   added: (at obj15 obj0)
   goals met: 3 of 8
14. (unload obj13 obj4 obj0)
   deleted: (in obj4 obj13)
   added: (at obj4 obj0)
   goals met: 4 of 8
15. (drive obj7 obj8 obj11)
   deleted: (at obj7 obj8)
   added: (at obj7 obj11)
   goals met: 4 of 8
16. (load obj6 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj6)
   goals met: 3 of 8
17. (load obj6 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj6)
   goals met: 2 of 8
18. (load obj6 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj6)
   goals met: 1 of 8
19. (load obj6 obj4 obj0)
   deleted: (at obj4 obj0)
   added: (in obj4 obj6)
   goals met: 0 of 8
20. (fly obj13 obj0 obj2)
   deleted: (at obj13 obj0)
   added: (at obj13 obj2)
   goals met: 0 of 8
21. (drive obj7 obj11 obj8)
   deleted: (at obj7 obj11)
   added: (at obj7 obj8)
   goals met: 0 of 8
22. (unload obj13 obj16 obj2)
   deleted: (in obj16 obj13)
   added: (at obj16 obj2)
   goals met: 0 of 8
23. (unload obj13 obj5 obj2)
   deleted: (in obj5 obj13)
   added: (at obj5 obj2)
   goals met: 0 of 8
24. (unload obj13 obj9 obj2)
   deleted: (in obj9 obj13)
   added: (at obj9 obj2)
   goals met: 0 of 8
25. (drive obj7 obj8 obj11)
   deleted: (at obj7 obj8)
   added: (at obj7 obj11)
   goals met: 0 of 8
26. (drive obj7 obj11 obj2)
   deleted: (at obj7 obj11)
   added: (at obj7 obj2)
   goals met: 0 of 8
27. (load obj7 obj16 obj2)
   deleted: (at obj16 obj2)
   added: (in obj16 obj7)
   goals met: 0 of 8
28. (load obj7 obj5 obj2)
   deleted: (at obj5 obj2)
   added: (in obj5 obj7)
   goals met: 0 of 8
29. (load obj7 obj9 obj2)
   deleted: (at obj9 obj2)
   added: (in obj9 obj7)
   goals met: 0 of 8
30. (drive obj7 obj2 obj11)
   deleted: (at obj7 obj2)
   added: (at obj7 obj11)
   goals met: 0 of 8
31. (load obj7 obj12 obj11)
   deleted: (at obj12 obj11)
   added: (in obj12 obj7)
   goals met: 0 of 8
32. (unload obj7 obj5 obj11)
   deleted: (in obj5 obj7)
   added: (at obj5 obj11)
   goals met: 1 of 8
33. (drive obj7 obj11 obj8)
   deleted: (at obj7 obj11)
   added: (at obj7 obj8)
   goals met: 1 of 8
34. (unload obj6 obj10 obj0)
   deleted: (in obj10 obj6)
   added: (at obj10 obj0)
   goals met: 2 of 8
35. (unload obj6 obj14 obj0)
   deleted: (in obj14 obj6)
   added: (at obj14 obj0)
   goals met: 3 of 8
36. (unload obj6 obj15 obj0)
   deleted: (in obj15 obj6)
   added: (at obj15 obj0)
   goals met: 4 of 8
37. (unload obj6 obj4 obj0)
   deleted: (in obj4 obj6)
   added: (at obj4 obj0)
   goals met: 5 of 8
38. (unload obj7 obj12 obj8)
   deleted: (in obj12 obj7)
   added: (at obj12 obj8)
   goals met: 6 of 8
39. (unload obj7 obj16 obj8)
   deleted: (in obj16 obj7)
   added: (at obj16 obj8)
   goals met: 7 of 8
40. (unload obj7 obj9 obj8)
   deleted: (in obj9 obj7)
   added: (at obj9 obj8)
   goals met: 8 of 8
